#+title: Global Precipitation Measurement (GPM)
#+author: J. Dylan White
#+date: <2021-11-11 Thu>

** Plotting the Data

It would be nice to not have to deal with separate monthly files. We'll use =h5py= to read in the =hdf5= file and explore the data first. There are two grids: =G1= and =G2= corresponding to the 0.25 degree grid and the 5 degree grid.

#+begin_src python :session one :exports both :results file

  # Import modules
  import h5py
  import numpy as np
  import matplotlib.pyplot as plt
  import cartopy.crs as ccrs
  from cartopy.mpl.ticker import LongitudeFormatter, LatitudeFormatter
  from mpl_toolkits.axes_grid1 import make_axes_locatable
  from cartopy.util import add_cyclic_point
  
  # Set the months and years to download the data
  month = 1 
  year = 2020

  # Set the data directory path
  dataDir = './data/'

  # Parse the date string
  date = datetime.datetime(year,month,1)
  dateString = date.strftime("%Y%m%d")

  # Set file path
  fileName = "3B-MO.MS.MRG.3IMERG."+dateString+"-S000000-E235959."+\
             str(month).zfill(2)+".V06B.HDF5"
  filePath = os.path.join(dataDir,fileName)

  # Read the HDF5 file
  f = h5py.File(filePath,'r')
  lat = f['Grid/lat'][:]
  lon = f['Grid/lon'][:]
  precip = f['Grid/precipitation'][:]
  precip = np.transpose(precip)
  precip = np.squeeze(np.where(precip==-9999.9,np.nan,precip))
  f.close()

  # Intialize the figure
  fig = plt.figure(figsize=(11,8.5))

  # Set up axes using a specified projection
  ax = plt.axes(projection=ccrs.PlateCarree(central_longitude=0))

  # Make a filled contour plot
  contour = ax.contourf(lon,lat,precip,
                        transform=ccrs.PlateCarree(),
                        cmap="viridis",extend='both')

  # Set up the tickmarks
  ax.set_xticks(np.arange(-180,181,45)[1:-1], crs=ccrs.PlateCarree())
  ax.set_yticks(np.arange(-90,91,30)[1:-1], crs=ccrs.PlateCarree())
  lon_formatter = LongitudeFormatter(number_format='.0f',
                                     degree_symbol='')
  lat_formatter = LatitudeFormatter(number_format='.0f',
                                    degree_symbol='')
  ax.xaxis.set_major_formatter(lon_formatter)
  ax.yaxis.set_major_formatter(lat_formatter)

  # Turn on coastlines
  ax.coastlines()

  # Set axis font sizes
  ax.tick_params(labelsize=14)

  # Configure colorbar
  cbar=plt.colorbar(contour,orientation="horizontal",pad=0.1)
  cbar.ax.tick_params(labelsize=14)
  #cbar.set_label('mm hr$^{-1}$',fontsize=16)

  # Save the figure
  fileName = 'images/monthly_precip.png'
  plt.savefig(fileName,dpi=300)
  plt.close()
  print(fileName)

#+end_src

#+RESULTS:
: Grid
: <KeysViewHDF5 ['nv', 'lonv', 'latv', 'time', 'lon', 'lat', 'time_bnds', 'lon_bnds', 'lat_bnds', 'precipitation', 'randomError', 'gaugeRelativeWeighting', 'probabilityLiquidPrecipitation', 'precipitationQualityIndex']>
: (1800, 3600)
: images/monthly_precip.png
